000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. Sistema.
000030 AUTHOR. Jan e Manoel.
000040 
000050 ENVIRONMENT DIVISION.
000051 CONFIGURATION SECTION.
000052 INPUT-OUTPUT SECTION.
000053 FILE-CONTROL.
000054     SELECT HOSPEDE ASSIGN TO NOME-HOSPEDE
000055     ORGANIZATION IS INDEXED
000056     ACCESS MODE IS DYNAMIC
000057     RECORD KEY IS CPF.
000058
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD HOSPEDE    
000063     LABEL RECORD STANDARD
000064     DATA RECORD IS REG-HOS.
000065 01  REG-HOS.
000066     02 CPF		PIC X(11).
000067     02 RG		PIC X(9).
000068     02 NOME	PIC X(13).
000069     02 DATANASC	PIC X(10).
000070     02 EMAIL	PIC X(20).
000071     02 TELEFONE	PIC X(10).
000072     02 ENDERECO	PIC X(20).
000073     02 CIDADE	PIC X(9).
000074     02 ESTADO	PIC X(2).
000075	 02 PAIS		PIC X(3).
000076	 02 NOMEPAIS	PIC X(30).
000077
000078 WORKING-STORAGE SECTION.
000079 77 NOME-HOSPEDE		PIC X(11) VALUE "HOSPEDE.DAT".
000080 77 OPER			PIC 9(1).
000081 77 RESP			PIC X(1).
000082 77 FIM-MENU                  	PIC 9(1) VALUE ZEROS.
000083 77 FIM-ARQ                   	PIC 9(1) VALUE ZEROS.
000084 
000088 PROCEDURE DIVISION.
000089 MAIN.
000090  
000091     PERFORM MENU UNTIL FIM-MENU = 1
000092
000093
000094     STOP RUN.
000095
000096 MENU.
000097     DISPLAY "--------------------------- SISTEMA HOTEL CALIFORNIA ---------------------------"
000098     DISPLAY " "
000099     DISPLAY "Digite: --------------------------------------------------"
000100     DISPLAY " 1 - Inserir Novo Hospede"
000101     DISPLAY " 2 - Alterar Dados do Hospede"
000102     DISPLAY " 3 - Excluir Hospede"
000103     DISPLAY " 4 - Consultar Hospede Cadastrado"
000104     DISPLAY " 5 - Relatorio de Hospede"
000105     DISPLAY " 0 - Sair do Sistema"
000106
000107     DISPLAY "Digite sua opcao: " WITH NO ADVANCING
000108     ACCEPT OPER
000109
000110     IF OPER = 1 THEN
000111       OPEN I-O HOSPEDE
000112       PERFORM INCLUIR 
000113       CLOSE HOSPEDE
000114     ELSE
000115       IF OPER = 2 THEN
000116          OPEN I-O HOSPEDE
000117          PERFORM ALTERAR 
000118          CLOSE HOSPEDE
000119       ELSE
000120          IF OPER = 3 THEN
000121             OPEN I-O HOSPEDE
000122             PERFORM EXCLUIR
000123             CLOSE HOSPEDE
000124          ELSE
000125             IF OPER = 4 THEN
000126                OPEN INPUT HOSPEDE
000127                PERFORM CONSULTAR
000128                CLOSE HOSPEDE
000129             ELSE
000130                IF OPER = 5 THEN
000131                   OPEN I-O HOSPEDE
000132                   MOVE 0 TO FIM-ARQ 
000133
000134                   DISPLAY "----------------------- RELATORIO DOS HOSPEDES DO HOTEL -----------------------"
000135                   PERFORM RELATORIO UNTIL FIM-ARQ = 1
000136                   CLOSE HOSPEDE
000137                ELSE
000138		IF OPER = 0 THEN
000139 	                  MOVE 1 TO FIM-MENU
000140		ELSE
000141		  DISPLAY "OPCAO INVALIDA"
000142		  DISPLAY "Digite: --------------------------------------------------"
000143     	  DISPLAY " 1 - Inserir Novo Hospede"
000144     	  DISPLAY " 2 - Alterar Dados do Hospede"
000145    	  DISPLAY " 3 - Excluir Hospede"
000146     	  DISPLAY " 4 - Consultar Hospede Cadastrado"
000147     	  DISPLAY " 5 - Relatorio de Hospedes"
000148	 	  DISPLAY " 0 - Sair do Sistema"
000149
000150     	  DISPLAY "Digite sua opcao: " WITH NO ADVANCING
000151		  ACCEPT OPER
000152		END-IF
000153                END-IF
000154            END-IF
000155         END-IF
000156       END-IF
000157     END-IF.
000158    
000159
000160 INCLUIR.
000161     
000162     DISPLAY " ----------------------- INSERCAO DE HOSPEDE -----------------------"
000163     
000164     PERFORM LEITURA
000165
000166     DISPLAY "CONFIRMA INSERCAO? (S ou N) :" WITH NO ADVANCING
000167     ACCEPT RESP
000168
000169     IF RESP = 'S' OR RESP = 's' THEN
000170        WRITE REG-HOS
000171        DISPLAY "INSERCAO CONCLUIDA COM SUCESSO"
000172     ELSE
000173        DISPLAY "INSERCAO CANCELADA"
000174     END-IF.
000175
000176 ALTERAR.
000177     
000178     DISPLAY " ----------------------- ALTERACAO DOS DADOS DO HOSPEDE -----------------------"
000179     
000180     DISPLAY "Digite o CPF do Hospede: " WITH NO ADVANCING 
000181     ACCEPT CPF
000182
000183     START HOSPEDE KEY IS EQUAL TO CPF INVALID KEY PERFORM ERRO-CADASTRO NOT INVALID KEY PERFORM IMPRIME
000184
000185     PERFORM LEITURA
000186
000187     DISPLAY "CONFIRMA ALTERACAO DOS DADOS? (S ou N) :" WITH NO ADVANCING
000188     ACCEPT RESP
000189     IF RESP = 'S' OR RESP = 's' THEN
000190        REWRITE REG-HOS
000191        DISPLAY "ALTERACAO EFETUADA COM SUCESSO"
000192     ELSE
000193        DISPLAY "ALTERACAO CANCELADA"
000194     END-IF.
000195     
000196     
000197 EXCLUIR.
000198     
000199     DISPLAY " ----------------------- EXCLUSAO DO HOSPEDE -----------------------"
000200
000201     DISPLAY "Digite o CPF do Hospede: " WITH NO ADVANCING 
000202     ACCEPT CPF
000203     START HOSPEDE KEY IS EQUAL TO CPF INVALID KEY PERFORM ERRO-CADASTRO NOT INVALID KEY PERFORM IMPRIME
000204  
000205     DISPLAY "CONFIRMA EXCLUSAO DO HOSPEDE? (S ou N) :" WITH NO ADVANCING
000206     ACCEPT RESP
000207     IF RESP = 'S' OR RESP = 's' THEN
000208        DELETE HOSPEDE
000209        DISPLAY "EXCLUSAO EFETUADA COM SUCESSO" 
000210     ELSE
000211        DISPLAY "EXCLUSAO CANCELADA"
000212     END-IF.
000213
000214 CONSULTAR.
000215
000216     DISPLAY " ----------------------- CONSULTA DO HOSPEDE -----------------------"
000217
000218     DISPLAY "Digite o CPF do Hospede: " WITH NO ADVANCING 
000219     ACCEPT CPF
000220
000221     START HOSPEDE KEY IS EQUAL TO CPF INVALID KEY PERFORM ERRO-CADASTRO NOT INVALID KEY PERFORM IMPRIME. 
000222    
000223 RELATORIO.
000224
000225     READ HOSPEDE NEXT RECORD AT END MOVE 1 TO FIM-ARQ.
000226     IF FIM-ARQ NOT = 1 THEN
000227        DISPLAY "-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-"
000228        DISPLAY "CPF:___________________", CPF     
000229        DISPLAY "NOME:__________________", NOME
000230        DISPLAY "RG:____________________", RG
000231        DISPLAY "DATA DE NASCIMENTO:____", DATANASC
000232        DISPLAY "TELEFONE:______________", TELEFONE
000233        DISPLAY "EMAIL:_________________", EMAIL
000234        DISPLAY "ENDERECO:______________", ENDERECO
000235        DISPLAY "CIDADE:________________", CIDADE
000236        DISPLAY "ESTADO:________________", ESTADO
000237        DISPLAY "PAIS:__________________", PAIS
000238        DISPLAY "NOME DOS PAIS:_________", NOMEPAIS
000239        DISPLAY "-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-X-".
000240 
000241 ERRO-CADASTRO.
000242     CLOSE HOSPEDE
000243     DISPLAY "ERRO: HOSPEDE NAO CONSTA NO SISTEMA"
000244     PERFORM MENU.
000245
000246 IMPRIME.
000247     READ HOSPEDE RECORD.
000248
000249     DISPLAY "----------------------- DADOS CADASTRADOS -----------------------"
000250     DISPLAY "CPF:___________________", CPF     
000251     DISPLAY "NOME:__________________", NOME
000252     DISPLAY "RG:____________________", RG
000253     DISPLAY "DATA DE NASCIMENTO:____", DATANASC
000254     DISPLAY "TELEFONE:______________", TELEFONE
000255     DISPLAY "EMAIL:_________________", EMAIL.
000256     DISPLAY "ENDERECO:______________", ENDERECO
000257     DISPLAY "CIDADE:________________", CIDADE.
000258     DISPLAY "ESTADO:________________", ESTADO.
000259     DISPLAY "PAIS:__________________", PAIS.
000260     DISPLAY "NOME DOS PAIS:_________", NOMEPAIS.
000261     
000262 LEITURA.
000263     
000264     DISPLAY "DIGITE O CPF (SOMENTE NUMEROS): " WITH NO ADVANCING     
000265     ACCEPT CPF 
000266     DISPLAY "NOME: " WITH NO ADVANCING
000267     ACCEPT NOME
000268     DISPLAY "RG (SOMENTE NUMEROS): " WITH NO ADVANCING
000269     ACCEPT RG
000270     DISPLAY "DATA NASC (DD/MM/AAAA): " WITH NO ADVANCING
000271     ACCEPT DATANASC
000272     DISPLAY "TELEFONE (DDD E NUMERO SEM ESPACO): " WITH NO ADVANCING
000273     ACCEPT TELEFONE
000274     DISPLAY "EMAIL: " WITH NO ADVANCING
000275     ACCEPT EMAIL.
000276     DISPLAY "ENDERECO: " WITH NO ADVANCING
000277     ACCEPT ENDERECO
000278     DISPLAY "CIDADE: " WITH NO ADVANCING
000279     ACCEPT CIDADE.
000280     DISPLAY "ESTADO (EX.: SP): " WITH NO ADVANCING
000281     ACCEPT ESTADO.
000282     DISPLAY "PAIS (EX.: BRA): " WITH NO ADVANCING
000283     ACCEPT PAIS.
000284     DISPLAY "NOME DOS PAIS (PAI / MAE) : " WITH NO ADVANCING
000285     ACCEPT NOMEPAIS.